# Introduction to Relational Databases in SQL

#### Query information_schema with SELECT
information_schema is a meta-database that holds information about your current database. information_schema has multiple tables you can query with the known SELECT * FROM syntax:

tables: information about all tables in your current database
columns: information about all columns in all of the tables in your current database
…
In this exercise, you'll only need information from the 'public' schema, which is specified as the column table_schema of the tables and columns tables. The 'public' schema holds information about user-defined tables and databases. The other types of table_schema hold system information – for this course, you're only interested in user-defined stuff.

#### Your first duty: Have a look at the PostgreSQL database
SELECT table_schema, table_name \
FROM information_schema.tables;

#### Have a look at the columns of a certain table
SELECT table_name, column_name, data_type\
FROM information_schema.columns\
WHERE table_name ='pg_config';

In [1]:
# -- Query the right table in information_schema
public = '''SELECT table_name 
FROM information_schema.tables
-- Specify the correct table_schema value
WHERE table_schema = 'public';'''

In [2]:
# -- Query the right table in information_schema to get columns
schema = '''SELECT column_name, data_type 
FROM information_schema.columns 
WHERE table_name = 'university_professors' AND table_schema = 'public';'''

# Tables: At the core of every database

#### Create new tables with CREATE TABLE
CREATE TABLE table_name ( \
    column_a data_type, \
    column_b data_type,\
    column_c data_type);

#### Create new tables with CREATE TABLE
CREATE TABLE weather (\
    clouds text,\
    temperature numeric,\
    weather_station char(5));

#### CREATE your first few TABLEs
You'll now start implementing a better database model. For this, you'll create tables for the professors and universities entity types. The other tables will be created for you.
The syntax for creating simple tables is as follows:

CREATE TABLE table_name (\
 column_a data_type,\
 column_b data_type,\
 column_c data_type
);\
Attention: Table and columns names, as well as data types, don't need to be surrounded by quotation marks.

In [3]:
# -- Create a table for the professors entity type
db = '''CREATE TABLE professors (
 firstname text,
 lastname text
);'''

# -- Print the contents of this table
p = '''SELECT * 
FROM professors;'''

In [4]:
# -- Create a table for the universities entity type
bdu = ''' CREATE TABLE universities(
    university_shortname text,
    university text,
    university_city text
);'''


# -- Print the contents of this table
pr = '''SELECT * 
FROM universities;'''

- Great job. The other two tables, affiliations and organizations, will be created for you.

### ADD a COLUMN with ALTER TABLE
Oops! We forgot to add the university_shortname column to the professors table. You've probably already noticed:

In chapter 4 of this course, you'll need this column for connecting the professors table with the universities table.

However, adding columns to existing tables is easy, especially if they're still empty.

To add columns you can use the following SQL query:

ALTER TABLE table_name\
ADD COLUMN column_name data_type;

In [6]:
# -- Add the university_shortname column
a = '''ALTER TABLE professors
ADD COLUMN university_shortname text;'''

# -- Print the contents of this table
pro = '''SELECT * 
FROM professors;'''

- Perfect – now your first sample database model is complete. Time to fill these tables with data!

# Update your database as the structure changes

#### Only store DISTINCT data in the new tables
SELECT COUNT(*)\
FROM university_professors;

SELECT COUNT(DISTINCT organization)\
FROM university_professors;

### INSERT DISTINCT records INTO the new tables
INSERT INTO organizations\
SELECT DISTINCT organization,\
organization_sector\
FROM university_professors;

INSERT INTO organizations\
SELECT organization, \
organization_sector\
FROM university_professors;

### The INSERT INTO statement 
INSERT INTO table_name (\
    column_a, column_b)\
VALUES ("value_a", "value_b");

### RENAME a COLUMN in affiliations 
CREATE TABLE affiliations (\
    firstname text,\
    lastname text,\
    university_shortname text,\
    function text,\
    organisation text);


ALTER TABLE table_name\
RENAME COLUMN old_name TO new_name;

### DROP a COLUMN in affiliations 
CREATE TABLE affiliations (\
    firstname text,\
    lastname text,\
    university_shortname text,\
    function text,\
    organisation text);

ALTER TABLE table_name\
DROP COLUMN column_name;

SELECT DISTINCT firstname,\
lastname,\
university_shortname\
FROM university_professors\
ORDER BY lastname;

SELECT DISTINCT firstname,\
lastname,\
FROM university_professors\
ORDER BY lastname;

### RENAME and DROP COLUMNs in affiliations
As mentioned in the video, the still empty affiliations table has some flaws. In this exercise, you'll correct them as outlined in the video.

You'll use the following queries:

In [7]:
# -- Rename the organisation column
c = '''ALTER TABLE affiliations
RENAME COLUMN organisation TO organization;'''

In [8]:
# -- Rename the organisation column
d = '''ALTER TABLE affiliations
RENAME COLUMN organisation TO organization;

-- Delete the university_shortname column
ALTER TABLE affiliations
DROP COLUMN university_shortname;'''

#### Migrate data with INSERT INTO SELECT DISTINCT
Now it's finally time to migrate the data into the new tables. You'll use the following pattern:

INSERT INTO ... \
SELECT DISTINCT ...\ 
FROM ...;\
It can be broken up into two parts:

First part:

SELECT DISTINCT column_name1, column_name2, ... \
FROM table_a;\
This selects all distinct values in table table_a – nothing new for you.

Second part:

INSERT INTO table_b ...;\
Take this part and append it to the first, so it inserts all distinct rows from table_a into table_b.

One last thing: It is important that you run all of the code at the same time once you have filled out the blanks.

In [9]:
# -- Insert unique professors into the new table
i = '''INSERT INTO professors 
SELECT DISTINCT firstname, lastname, university_shortname 
FROM university_professors;

-- Doublecheck the contents of professors
SELECT * 
FROM professors;'''

In [10]:
# -- Insert unique affiliations into the new table
a = '''INSERT INTO affiliations 
SELECT DISTINCT firstname, lastname, function, organization 
FROM university_professors;

-- Doublecheck the contents of affiliations
SELECT * 
FROM affiliations;'''

- Perfect. You can see that there are 1377 distinct combinations of professors and organisations in the dataset. We'll migrate the other two tables universities and organisations for you. The last thing to do in this chapter is to delete the no longer needed university_professors table.

### Delete tables with DROP TABLE
Obviously, the university_professors table is now no longer needed and can safely be deleted.

For table deletion, you can use the simple command:

DROP TABLE table_name;

In [11]:
# -- Delete the university_professors table
de = '''DROP TABLE university_professors;'''

- Perfect! Now it's finally time to delve into the real advantages of databases. In the following chapters, you will discover many cool features that ultimately lead to better data consistency and quality, such as domain constraints, keys, and referential integrity. See you soon!